app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "users" LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page] || 1, :per_page => 5)

INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "email") VALUES('Tode Ristov', '30b22315d420388ed86453008931b4d3070413234d7f016c6d42a4799d094af8', 'd432b8e8815549d98b53104dd86a1a516820f7a569c4a568176f7e88ca353cd6', '2010-09-26 18:48:41', '2010-09-26 18:48:41', 'toderistov@hotmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save